Repository: duongminhhieu/LetTutor-2024-Flutter-Education-Application
Catalog: src/lib/l10n/app_*.arb
Languages: vi

# title
source: Say Hello to your English tutors
vi: Hãy nói tiếng Anh như người bản xứ

# descriptionTitle
source: Become fluent faster through one on one video chat lessons tailored to your goals.
vi: Phát triển kỹ năng tiếng Anh nhanh nhất bằng cách học 1 kèm 1 trực tuyến theo mục tiêu và lộ trình dành cho riêng bạn.

source: Password
vi: Mật khẩu

# hintPassword
source: Enter your password
vi: Nhập mật khẩu

source: Forgot password?
vi: Quên mật khẩu?

source: Login
vi: Đăng nhập

source: Or continue with
vi: Hoặc tiếp tục với

# dontHaveAccount
source: Don't have an account?
vi: Chưa có tài khoản?

source: Sign up
vi: Đăng ký

# alreadyHaveAccount
source: Already have an account?
vi: Đã có tài khoản?

source: Confirm password
vi: Xác nhận mật khẩu

source: Upcoming lesson
vi: Lớp học sắp tới

# noUpComingLesson
source: You have no upcoming lesson
vi: Bạn không có lớp học sắp tới

# totalLessonTime
source: Total lesson time is
vi: Tổng thời gian học là

source: Find a tutor
vi: Tìm gia sư

source: Enter tutor name...
vi: Nhập tên gia sư...

# selectAvailableTime
source: Select available tutoring time:
vi: Chọn thời gian học:

source: Select date
vi: Chọn ngày

source: Select tutor nationality
vi: Chọn quốc tịch gia sư

source: Recommend tutors
vi: Gia sư được đề xuất

source: Book
vi: Đặt lịch

source: Schedule
vi: Lịch học

source: History
vi: Lịch sử

source: Course
vi: Khoá học

source: Settings
vi: Cài đặt

source: Join Meeting
vi: Vào lớp học

source: Tutor Details
vi: Thông tin gia sư

source: Favorite
vi: Yêu thích

source: Report
vi: Báo cáo

source: Reviews
vi: Đánh giá

source: Languages
vi: Ngôn ngữ

source: Education
vi: Học vấn

source: Specialities
vi: Chuyên ngành

source: Interests
vi: Sở thích

source: Teaching experience
vi: Kinh nghiệm giảng học

source: Enter lesson room
vi: Vào lớp học

source: Started
vi: Đã bắt đầu

# unFavoriteMessage
source: Unfavored tutor successfully!
vi: Bỏ yêu thích gia sư thành công!

# favoriteMessage
source: Favored tutor successfully!
vi: Yêu thích gia sư thành công!

source: Latest Book
vi: Sách mới nhất

# requestForTutorial
source: Your requests for the tutor
vi: Yêu cầu cho gia sư

source: Request for lesson
vi: Yêu cầu cho lớp học

source: Edit request
vi: Chỉnh sửa yêu cầu

# studentRequestEmpty
source: Currently there are no requests for this class. Please write down any requests for the teacher.
vi: Hiện tại bạn chưa có yêu cầu nào cho lớp học

# reasonCancelBooking
source: What was the reason you cancel this booking?
vi: Lý do huỷ lớp học của bạn ?

# cancelLessonNotAllow
source: You can only cancel the lesson before 2 hours
vi: Bạn chỉ có thể huỷ lớp học trước 2 tiếng

source: Lesson Time
vi: Thời gian học

source: Special Request
vi: Yêu cầu đặc biệt

source: Choose your birthday
vi: Chọn ngày sinh của bạn

source: Capture Photo
vi: Chụp ảnh

# selectFromGallery
source: Choose from Gallery
vi: Chọn ảnh từ thư viện

source: Profile
vi: Hồ sơ

# otherReviewYou
source: Others review you
vi: Đánh giá về bạn

source: Change Password
vi: Đổi mật khẩu

source: Enter your name
vi: Nhập tên của bạn

source: Enter your email
vi: Nhập email của bạn

source: Country
vi: Quốc gia

source: Enter your phone number
vi: Nhập số điện thoại của bạn

# updateAvatarSuccess
source: Update avatar successfully!
vi: Cập nhật ảnh đại diện thành công!

# updateProfileSuccess
source: Update profile successfully!
vi: Cập nhật hồ sơ thành công!

# updateAvatarFail
source: Update avatar failed!
vi: Cập nhật ảnh đại diện thất bại!

# updateProfileFail
source: Update profile failed!
vi: Cập nhật hồ sơ thất bại!

# tapToChangeProfile
source: Tap to change your profile
vi: Nhấn để thay đổi hồ sơ

source: App Settings
vi: Cài đặt ứng dụng

# manageWallet
source: Manage your Wallet
vi: Quản lý ví

# howToBecomeTutor
source: How to become a tutor
vi: Làm thế nào để trở thành gia sư?

# learnAbout
source: Learn more about LetTutor App
vi: Tìm hiểu về LetTutor

# logoutDes
source: Log out LetTutor App
vi: Bạn có chắc chắn muốn đăng xuất?

source: Discover Course
vi: Khám phá khóa học

# discoverCourseSubTitle
source: LiveTutor has built the most quality, methodical and scientific courses in the fields of life for those who are in need of improving their knowledge of the fields.
vi: LiveTutor đã xây dựng nên các khóa học của các lĩnh vực trong cuộc sống chất lượng, bài bản và khoa học nhất cho những người đang có nhu cầu trau dồi thêm kiến thức về các lĩnh vực.

source: Interactive Book
vi: Sách tương tác

source: Lesson Detail
vi: Chi tiết bài học

source: Add Rating
vi: Thêm đánh giá

# whatIsYourRating
source: What is your rating for
vi: Đánh giá của bạn cho

source: Content Review
vi: Nội dung đánh giá

source: Later
vi: Để sau

source: Submit
vi: Gửi

# historySubTitle
source: The following is a list of lessons you have attended. You can review the details of the lessons you have attended
vi: Đây là danh sách các bài học bạn đã tham gia. Bạn có thể xem lại thông tin chi tiết về các buổi học đã tham gia đã tham gia

source: Booking Time
vi: Thời gian học

source: Book this tutor
vi: Đặt gia sư này

source: Booking Details
vi: Chi tiết đặt hẹn

# bookingCanOnlyMade
source: Bookings can only be made within the last 7 days.
vi: Lịch hẹn chỉ có thể đặt trong 7 ngày gần nhất

source: Payment
vi: Thanh toán

# priceLesson
source: Price: 1 lesson
vi: Giá: 1 bài học

# haveLessonLess
source: You have 1 lesson left
vi: Bạn còn 1 bài học

source: Notes
vi: Ghi chú

# leaveANote
source: Leave a note for your tutor
vi: Để lại ghi chú cho giảng viên

# helpUs
source: Help us know what's happening
vi: Giúp chúng tôi biết chuyện gì đang xảy ra

# tutorPretend
source: This tutor is pretending to be someone else
vi: ia sư này đang sử dụng thông tin của người khác

# tutorShady
source: This tutor's profile information is incorrect, shady
vi: Thông tin hồ sơ của gia sư này không chính xác

# tutorHarassing
source: This tutor is harassing me
vi: Gia sư này đang làm phiền tôi

source: Cancel
vi: Huỷ bỏ

source: Send report
vi: Gửi báo cáo

source: My schedule
vi: Lịch của tôi

source: Lesson date
vi: Ngày học

source: Start time
vi: Giờ bắt đầu

source: End time
vi: Giờ kết thúc

source: Go to meeting
vi: Vào lớp học

# hereIsAList
source: Here is a list of booked lessons. You can track when will the lesson starts, join the meeting or cancel before 2 hours
vi: Đây là danh sách các lớp học dã được đặt. Bạn có thể theo dõi khi nào lớp học bắt đầu, vào lớp hoặc huỷ bỏ trước 2 tiếng

# wentWrong
source: Oops, something went wrong
vi: Rất tiếc đã xảy ra lỗi

source: Analysis
vi: Thống kê

source: Send
vi: Gửi

source: Send note
vi: Gửi ghi chú

source: Learning History
vi: Lịch sử học

source: Last 1 month
vi: 1 tháng gần nhất

source: Last 3 month
vi: 3 tháng gần nhất

source: Last 6 month
vi: 6 tháng gần nhất

# selectAFilter
source: Select displaying mode
vi: Chọn chế độ hiển thị

# hasNoReview
source: This lesson has no review from tutor.
vi: Bài học này không có đánh giá từ gia sư.

source: Add a review
vi: Thêm đánh giá

source: Create review
vi: Tạo đánh giá

# tellUsHow
source: Tell us how was the lesson...
vi: Nhận xét về buổi học của bạn...

source: Rate
vi: Đánh giá

# rateAfterLesson
source: after the lesson with him/her on
vi: sau buổi học cùng với anh/chị ấy vào

source: Send review
vi: Gửi đánh giá

source: Cancel lesson
vi: Huỷ lịch

# doYouWantToCancel
source: Do you want to cancel this lesson?
vi: Bạn có chắc chắn muốn huỷ lịch học này?

# leaveReasonWhyCancel
source: Leave the reason why you cancel this lesson...
vi: Lý do tại sao bạn muốn huỷ lớp học...

source: Confirm
vi: Xác nhận

source: Tutor
vi: Gia sư

# tutorDescription
source: Find a tutor for a one-on-one lesson
vi: Tìm gia sư cho buổi học 1 kèm 1 riêng

# courseDescription
source: Or exploring yourself with our library of lessons and ebooks
vi: Hoặc tự khám phá với thư viện bài giảng của chúng tôi

source: Online Tutors
vi: Danh sách gia sư

source: Select a speciality
vi: Chọn chuyên môn

source: Select nationality
vi: Chọn quốc tịch

source: Select origin
vi: Chọn xuất xứ

source: Search
vi: Tìm

source: Online Courses
vi: Danh sách khoá học

source: Input course name...
vi: Nhập tên khoá học...

source: All courses
vi: Khoá học

source: Level
vi: Cấp độ

source: Lessons
vi: Khoá học

# courseDetail
source: Course Details
vi: Chi tiết khoá học

source: Discover
vi: Khám phá

source: Overview
vi: Tổng quan

source: Why take this course
vi: Lý do nên học

# whatAbleToDo
source: What will you be able to do
vi: Bạn sẽ đạt được gì

source: Experience Level
vi: Cấp độ kinh nghiệm

source: Course Length
vi: Độ dài khoá học

source: Topics
vi: Chủ đề

source: List of Topic
vi: Danh sách chủ đề

source: Categories
vi: Thể loại

source: Account
vi: Tài khoản

source: My wallet
vi: Ví của tôi

source: Become a tutor
vi: Trở thành gia sư

source: Application
vi: Ứng dụng

source: Language
vi: Ngôn ngữ

# themeMode
source: Theme
vi: Chế độ nền

source: Dark mode
vi: Chế độ nền tối

# applicationInfo
source: Application information
vi: Thông tin ứng dụng

source: Privacy policies
vi: Chính sách bảo mật

# termsAndConditions
source: Terms & conditions
vi: Điều khoản và quy định

source: Contact for support
vi: Hỗ trợ liên lạc

# receiveInAppNoti
source: Receive in-app notification
vi: Nhận thông báo từ ứng dụng

source: Receive email
vi: Nhận email từ ứng dụng

source: Receive SMS text
vi: Nhận tin nhắn SMS từ ứng dụng

source: Vietnamese
vi: Tiếng Việt

source: English
vi: Tiếng Anh

source: Light mode
vi: Chế độ nền sáng

source: Version
vi: Phiên bản

# forFurtherInfo
source: For further info, please visit our detailed
vi: Để biết thêm chi tiết, hãy truy cập trang

source: Official page
vi: Web chính thức

source: Logout
vi: Đăng xuất

# doYouWantLogout
source: Do you want to log out?
vi: Bạn có muốn đăng xuất?

source: Yes
vi: Có

source: No
vi: Không

source: Edit Account
vi: Chỉnh sửa tài khoản

source: Name
vi: Họ và tên

source: Nationality
vi: Quốc tịch

source: Phone number
vi: Số điện thoại

source: Birthday
vi: Sinh nhật

source: My level
vi: Trình độ

source: Want to learn
vi: Chuyên môn muốn học

source: Study schedule
vi: Lịch học

# noteTheTime
source: Note the time of week you want to study/teach
vi: Ghi chú thời gian biểu rảnh rỗi để học/dạy của bạn

source: Save changes
vi: Lưu thay đổi

# typeYourMsg
source: Type your message here
vi: Nhập ghi chú của bạn ở đây

source: Appointment
vi: Đặt lịch hẹn

source: Notifications
vi: Thông báo

source: Confirm booking
vi: Xác nhận đặt lịch

# noUpcomingLesson
source: You have no upcoming lesson
vi: Bạn không có lịch học sắp tới

source: No available schedule
vi: Chưa có lịch hẹn

# eWalletNotAvailable
source: E-wallet is not supported in this version, please access to our website for more info
vi: Ví điện tử chưa được hỗ trợ trong phiên bản này, hãy truy cập website của chúng tôi để biết thêm thông tin.
